Tressilloide/Serra_smart/Kimi_Agent_Smart Greenhouse ESP32 LoRa/camera_ponte/camera_ponte.ino
  if (wifiGiuDa == 0) wifiGiuDa = millis();

  /*
   * Riavvio SOLO se il WiFi resta giu' a lungo, non piu' a intervalli fissi.
   * La versione precedente faceva ESP.restart() ogni ora a prescindere:
   * durante i secondi di riavvio la radio non ascolta, e con il nodo che
   * trasmette ogni 15 minuti c'era una probabilita' concreta di perdere
   * proprio quel pacchetto.
   */
  if (millis() - wifiGiuDa > REBOOT_WIFI_DOWN_MS) {
    Serial.println(F("[WiFi] Giu' da troppo tempo: riavvio il ponte."));
    delay(500);
    ESP.restart();
  }

  if (millis() - ultimoTentativoWifi < WIFI_RETRY_MS) return;
  ultimoTentativoWifi = millis();

  Serial.println(F("[WiFi] Disconnesso, ritento..."));
  WiFi.disconnect();
  WiFi.begin(WIFI_SSID, WIFI_PASS);
}

// ============================ ORA (NTP) =====================================

// L'ora del ponte viaggia su ogni ACK ed e' quella con cui la serra corregge
// il proprio DS1307: e' l'unico orologio affidabile del sistema.
static uint32_t oraCorrente() {
  time_t adesso = time(nullptr);
  return (adesso > 1700000000L) ? (uint32_t)adesso : 0;
}

// ============================ MQTT ==========================================

static void mqttCallback(char* topic, byte* payload, unsigned int len) {
  codaMessaggioMqtt(topic, payload, len);
}

static void mqttMantieni() {
  if (WiFi.status() != WL_CONNECTED) return;
  if (mqtt.connected()) return;
  if (millis() - ultimoTentativoMqtt < MQTT_RETRY_MS) return;
  ultimoTentativoMqtt = millis();

  Serial.print(F("[MQTT] Connessione al broker... "));

  // Last Will: se il ponte muore, Home Assistant segna subito le entita'
  // come non disponibili invece di mostrare valori vecchi come se fossero attuali.
  if (mqtt.connect(MQTT_CLIENT_ID, MQTT_USER, MQTT_PASS,
                   TOPIC_PONTE, 1, true, "offline")) {
    // La PRIMA connessione non e' una riconnessione: contarla farebbe
    // sembrare instabile un ponte appena avviato che invece sta benissimo.
    // Questi contatori servono a rispondere a "sta reggendo?", quindi devono
    // partire da zero e restarci finche' non succede davvero qualcosa.
    static bool primaConnessione = true;
    if (primaConnessione) primaConnessione = false;
    else                  riconnessioniMqtt++;

    Serial.printf("OK! (riconnessioni finora: %lu, uptime %lu s)\n",
                  (unsigned long)riconnessioniMqtt,
                  (unsigned long)(millis() / 1000UL));
    mqtt.publish(TOPIC_PONTE, "online", true);
    mqtt.subscribe(TOPIC_CMD_SUB, 1);
    // Subito dopo la sottoscrizione il broker riversa i messaggi ritenuti:
    // i comandi di azione che arrivano adesso sono residui, non richieste.
    codaSegnalaSottoscrizione();

    /*
     * La discovery NON si ripubblica a ogni riconnessione.
     *
     * Sono tredici messaggi ritenuti da ~400 byte: una raffica di 5 KB spinta
     * nel socket alla massima velocita'. Su un WiFi debole basta a far cadere
     * la connessione appena stabilita, il che provoca una riconnessione, che
     * rilancia la raffica. Nel log del ponte si vedeva nitidamente:
     * connessione riuscita, tredici pubblicazioni, caduta dopo cinque secondi,
     * e tutto da capo.
     *
     * Ripubblicare ogni volta era comunque inutile: quei messaggi sono
     * RITENUTI, quindi e' il broker a conservarli. Serve farlo al primo avvio
     * e, per sicurezza, ogni tanto, nel caso il broker sia stato reinstallato.
     */
    uint32_t adessoMs = millis();
    bool servePubblicare = (ultimaDiscovery == 0) ||
                           (adessoMs - ultimaDiscovery > DISCOVERY_RIPUBBLICA_MS);

    if (servePubblicare) {
      discoveryReset();
      if (discoveryPubblicaComandi() && discoveryPubblicaPonte())
        ultimaDiscovery = adessoMs ? adessoMs : 1;   // 0 e' riservato a "mai"
      else
        Serial.println(F("[HA] Discovery interrotta: riprovo alla prossima connessione."));
    } else {
      Serial.printf("[HA] Discovery gia' pubblicata %lu min fa: la salto.\n",
                    (unsigned long)((adessoMs - ultimaDiscovery) / 60000UL));
    }

    codaPubblicaPending();
  } else {
    Serial.printf("fallita (rc=%d), riprovo tra %lu s.\n",
                  mqtt.state(), MQTT_RETRY_MS / 1000UL);
  }
}

// ============================ DEDUP =========================================

static bool giaVisto(uint32_t seq, uint32_t ts) {
  for (uint8_t i = 0; i < DEDUP_MEMORIA; i++)
    if (dedup[i].seq == seq && dedup[i].ts == ts) return true;
  return false;
}

static void ricorda(uint32_t seq, uint32_t ts) {
  dedup[dedupIdx].seq = seq;
  dedup[dedupIdx].ts  = ts;
  dedupIdx = (dedupIdx + 1) % DEDUP_MEMORIA;
}

// ============================ JSON ==========================================

// true se la stringa e' un numero valido per intero (e non, per esempio,
// "2.0.0" o "ok", che nel JSON vanno virgolettati).
static bool eNumerico(const char* s) {
  if (!s || !*s) return false;
  char* fine = nullptr;
  strtod(s, &fine);
  return fine && *fine == '\0';
}

/*
 * Converte il pacchetto in JSON copiando OGNI coppia chiave=valore cosi'
 * com'e'. E' qui che si vede il vantaggio del protocollo v2: il ponte non ha
 * bisogno di sapere quali sensori esistono, quindi aggiungerne uno alla serra
 * non richiede di riflashare anche lui.
 */
static size_t costruisciJson(const PacchettoKV& pkt, char* out, size_t maxOut,
                             int rssi, float snr) {
  /*
   * La coda del JSON viene preparata PRIMA e il suo spazio riservato per tutto
   * il ciclo. Non e' pignoleria: se il buffer si riempisse con i campi, la
   * graffa di chiusura verrebbe troncata e Home Assistant scarterebbe l'intero
   * pacchetto come JSON non valido — tutti i sensori fermi, senza un errore
   * che spieghi perche'. Meglio perdere qualche campo che l'intero messaggio.
   */
  char coda[96];
  int  lCoda = snprintf(coda, sizeof(coda),
                        ",\"rssi\":%d,\"snr\":%.1f,\"ts_ponte\":%lu}",
                        rssi, snr, (unsigned long)oraCorrente());
  if (lCoda < 0 || (size_t)lCoda >= sizeof(coda) || maxOut < (size_t)lCoda + 4) {
    out[0] = '\0';
    return 0;
  }

  size_t pos = 0;
  out[pos++] = '{';
  out[pos]   = '\0';

  bool primo = true, tagliato = false;
  char campo[PROTO_LEN_CHIAVE + PROTO_LEN_VALORE + 8];

